{
    "task_attr_mod_color_12022.png": "Two people are standing in a lush, green forest. They are both smiling and holding an ornate, square artifact featuring intricate designs and a central circular element. The forest background includes tall trees and ferns. Both individuals are casually dressed in t-shirts.",
    "task_attr_mod_color_122007.png": "A woman with a gentle smile, adorned with a crown of colorful flowers in her hair. The flowers are in shades of pink and orange. Her hair is styled in a neat updo, and she has a subtle makeup look with a natural complexion. The background is a plain, muted tone.",
    "task_attr_mod_color_126592.png": "A stylized, eerie figure with an elongated bald head, pointed ears, and sharp facial features, reminiscent of a vampire or Nosferatu-like character. The figure is sitting at a table with an open book, holding a pen poised to write. The setting is dimly lit, creating a mysterious and gothic atmosphere. The book contains cursive writing, and the character's expression appears intense and focused.",
    "task_attr_mod_color_137966.png": "A pair of black ice skates resting on a smooth, frozen lake. The clear ice reflects the skates and the surrounding landscape. In the background, there are snow-covered evergreen trees lining the lake, with a cloudy sky above, creating a serene winter scene.",
    "task_attr_mod_color_138547.png": "A person dressed in a classic detective-style outfit, including a hat and tie, looking intently at the camera. The person has a mustache and is holding a shaving brush up close to their face, which has shaving cream applied to parts of it. The expression is serious and intense.",
    "task_attr_mod_color_177825.png": "An astronaut in a white spacesuit standing on a barren, rocky terrain resembling Mars. The astronaut is waving and is positioned near a large rover with oversized wheels. A smaller robotic rover is nearby on the reddish-brown surface. The landscape in the background features rolling hills under a clear sky.",
    "task_attr_mod_color_192083.png": "A dramatic, surreal scene of a large ship emerging from the ocean as if it's taking flight. The vessel is angled upward, with the front tilted into the air, surrounded by splashes of water and turbulence. In the background, there is another flying object with a futuristic or fantastical design. The setting is dark and moody, with a cloudy sky bathed in a cold, bluish light, suggesting a scene straight out of a fantasy or science fiction narrative.",
    "task_attr_mod_color_206580.png": "A silver SEAT Arona parked on a cobblestone street in a quaint urban setting. The compact SUV exhibits a modern, angular design with LED headlights and a prominent front grille. Its sporty alloy wheels and elevated stance are notable. The background showcases pastel-colored buildings with simple, traditional architecture, adding a contrast between the contemporary vehicle and the classic surroundings. There are two tall windows and a door visible in the background, and a small shrub is positioned to the left.",
    "task_attr_mod_color_232492.png": "A long, rusted metal pole or beam lying on a pebbled beach. The pole is partially submerged in ocean water, with waves gently washing over it. The pebbles vary in size and color, ranging from gray to brown. The scene captures a weathered, coastal environment, indicating exposure to natural elements over time.",
    "task_attr_mod_color_47418.png": "A gray, rotund creature sitting contentedly beneath a large, red-capped mushroom in a forest setting. The character, resembling a fictional creature, has pointy ears, large eyes, and whiskers. The forest floor around it is covered in lush green foliage, and smaller mushrooms with red caps and white spots are nearby. The background shows tall trees, contributing to the whimsical, storybook atmosphere.",
    "task_attr_mod_color_59806.png": "A sophisticated, humanoid robot in a futuristic urban setting. The robot is made of sleek, golden metal, with detailed mechanical parts visible, and glowing eyes. It stands in a narrow alleyway with neon signs displaying various symbols and characters in the background, giving the scene a cyberpunk ambiance. The environment is dimly lit, adding to the futuristic and high-tech atmosphere.",
    "task_attr_mod_color_6205.png": " two individuals dressed as Mario and Luigi from the Super Mario franchise. They are each wearing oversized costumes consisting of bright blue overalls, brown shoes, white gloves, and red and green shirts respectively. Each also dons a red cap with the iconic \"M\" emblem. One is standing with a hand on hip, while the other is sitting casually on a large metal object, possibly a storage trunk or container. The setting appears to be indoors, with a simple, light-colored wall in the background.",
    "task_attr_mod_color_86536.png": "A person wearing white and purple basketball shoes on a wooden court. The shoes have a sleek and sporty design, with intricate patterns and a high-top style. The person is also wearing white socks, and their legs are slightly bent, suggesting they are in motion or ready to move. The background is a polished wooden basketball court surface.",
    "task_attr_mod_color_87731.png": "A woman with long blonde hair and closed eyes, holding a green glass bottle upright. The bottle has an intricate design on it, and the woman appears peaceful, with her lips touching the bottle's neck. She is wearing a pale pink outfit, and the background is a textured soft pink pattern.",
    "task_attr_mod_color_97708.png": "A futuristic, metallic robotic figure wearing over-ear headphones. The headphones are sleek and modern in design, suggesting advanced technology. The robot's head is smooth and dome-shaped, made of a shiny, silver material. The background is a plain, dark gradient, allowing the robot and headphones to stand out prominently, emphasizing the high-tech theme.",
    "task_env_weather_126577.png": "An elderly woman with gray hair and a serious expression. Her face is marked by deep wrinkles, highlighting her age. She is wearing a light gray coat. The background consists of bare branches, suggesting an outdoor setting in a possibly cold or late fall/winter season.",
    "task_env_weather_132698.png": "A person dressed as a clown standing on a path surrounded by woodland. The clown is wearing a detailed costume with ruffled layers, puffy sleeves, and pom-pom decorations. The color scheme is primarily gray with red accents, including red buttons and a red nose. The clown is wearing large, bright yellow shoes and has orange hair. The background shows a forested area with tall grass and scattered leaves on the ground. The clown is striking a pose with one hand raised.",
    "task_env_weather_143286.png": "A vintage orange sports car parked on a paved area. The car has a sleek, aerodynamic design typical of classic cars from the 1970s, with a coupe body style and two doors. The setting appears to be a park or wooded area, with trees and greenery in the background, giving the scene a serene atmosphere. The lighting suggests it's either early morning or late afternoon, adding a warm glow to the image.",
    "task_env_weather_146611.png": "A person in a stylized, cartoon-like fashion. They are wearing a white visor cap, with spiky brown hair peeking out from underneath. The person is holding a blue backpack strap with one hand, and appears to be standing on a path in a lush, green park surrounded by trees. The setting suggests a pleasant, sunny day, suitable for outdoor activities.",
    "task_env_weather_182095.png": "A robot standing in an urban setting. The robot has a humanoid shape with a metal body and spiky red hair. Its eyes are large and red, giving it an expressive look. It stands on mechanical legs with treads, resembling tank tracks. The background features an industrial or dilapidated building with a gritty, deserted street scene.",
    "task_env_weather_224698.png": " three characters in a fantasy setting with lush forest scenery in the background. The individuals appear to be in medieval or fantasy-style clothing. Two of them, older men with long gray beards and hair, are holding glasses of beer. The woman in the center, with long blonde hair and a green dress, is also holding a glass, smiling and appearing to be engaged in conversation with the men. The scene has a warm, friendly atmosphere typical of a festive gathering.",
    "task_env_weather_24075.png": "A person dressed in a costume with a vintage and rugged style. They are wearing a wide-brimmed brown hat, a pinstriped vest over a white shirt with rolled-up sleeves, and accessorized with leather gloves and a belt with various items attached. The person has long hair and facial hair, and there are beads and adornments hanging from the hair. The background is a natural setting, with greenery and trees, suggesting an outdoor location.",
    "task_env_weather_253726.png": "A whimsical, cartoonish blue monster with pink eyes and a wide toothy grin, holding a large ice cream cone with pink swirled ice cream. The monster has fluffy fur and small red horns on its head. Its tongue is sticking out in delight. In the background, there is an ice cream shop with a pink and orange umbrella and orange chairs, set in a sunny, vibrant outdoor setting.",
    "task_env_weather_261413.png": "A stylized, anthropomorphic frog with a green, textured skin and large, expressive eyes. The frog has a slight smile and is wearing a light-colored, high-collared garment. In the background, there is a natural setting with dry grass and blurred trees, giving a forest-like appearance. The lighting suggests a calm and serene atmosphere.",
    "task_env_weather_33063.png": "A woman standing outdoors in a garden setting. She is wearing an elegant black dress with intricate lace detailing that covers the shoulders and chest area. Her hair is styled in an updo, and the background features manicured greenery and trees. The overall atmosphere is sophisticated and serene.",
    "task_env_weather_39740.png": "A classic dark green Mini Cooper parked on a neatly manicured lawn. The car has a shiny finish with chrome detailing on its bumpers, grille, and door handles. It features a distinctively compact and rounded body, typical of the vintage Mini design, with beige interior visible through the windows. The car is set against a backdrop of tall, dense green hedges, creating a natural, serene setting. The front license plate displays the registration number \"1964 919\".",
    "task_env_weather_65003.png": "A statue of an Egyptian deity with the head of a jackal, likely representing Anubis. The statue features a sleek humanoid form with a black head, elongated ears, and golden eyes. It is adorned with a traditional gold and black Egyptian collar, and set against a plain background with a few greenish plants visible at the base.",
    "task_env_weather_67175.png": " three sleek sports cars parked in a desert landscape with mountains in the background. The cars have futuristic designs with aerodynamic features. The foreground car is white with sharp angles and a prominent rear spoiler. Behind it to the left is a blue car with a bold front grille, and to the right, an orange car completes the trio. The scene is set during sunset, providing warm lighting.",
    "task_env_weather_82168.png": "A metallic, futuristic spaceship with a unique symmetrical design, floating in space above a planet. The spaceship has a conical shape with pointed ends on both the top and bottom. Its surface features a series of panels and rivets, giving it an industrial appearance. The background shows the curvature of a planet with a thin atmosphere and the vastness of space beyond.",
    "task_env_weather_96166.png": "A large, futuristic structure resembling a flying saucer or spacecraft. It is supported by several sturdy legs anchored to the ground. The environment is a grassy field with mountains visible in the background, under a blue sky with scattered clouds. The Earth is visible in the top left corner, suggesting a setting either in a sci-fi scenario or another planet. A table with an umbrella and chairs is seen in the foreground, adding a human element to the otherwise alien-looking scene.",
    "task_obj_add_166344.png": "A long train with distinctive dome-like windows, traveling through a scenic landscape. The train is moving alongside a lush, green field with trees in the background. Above, the sky is filled with large, dramatic clouds, creating a picturesque and serene atmosphere.",
    "task_obj_add_175625.png": "A warrior standing in a snowy landscape. The character is wearing traditional-looking armor with a mask covering the lower part of the face. There is a rope tied around the armor, and the warrior appears to be holding a weapon. In the background, there are stone lanterns partially covered in snow, and the atmosphere is misty, adding to the sense of cold and mystery. The scene has a cinematic and dramatic feel.",
    "task_obj_add_259626.png": "A group of eight men, likely part of a sports team, posing for a photo. They are wearing matching red polo shirts with a logo and white pants. Four men are seated in the front row on small chairs, while four stand behind them. One of the seated individuals is holding a trophy, suggesting they have won a competition. The setting is outdoors on a green field, possibly a golf course.",
    "task_obj_add_261272.png": "A stylish, industrial-style interior living space with exposed brick walls. The room features large windows with roller shades that let in ample natural light. There’s a wall-mounted TV and a black leaning ladder shelf with plants. The space includes a modern armchair and a cozy area rug on a polished concrete floor. Notable elements include a large, clear light bulb hanging from the ceiling and a contemporary round table with chairs. The overall aesthetic is warm and inviting, with a mix of rustic and modern design elements.",
    "task_obj_add_275400.png": "A black and white portrait of a person with curly, light-colored hair styled in a classic, voluminous manner. They have prominent makeup, with dark lipstick and defined eyebrows. The lighting highlights their face and shoulders, creating a glamorous, vintage look against a plain background.",
    "task_obj_add_35093.png": "A scenic landscape with a bridge at the center, set in a grassy area surrounded by greenery. In the background, there are mountain ranges partially covered with snow. The sky is clear and blue, suggesting a sunny day. Near the bridge, a few people are walking, and there are some signs and a sculpture-like object in the vicinity. The area appears to be a park or open space, ideal for outdoor activities.",
    "task_obj_add_441549.png": "A mountainous landscape during twilight, with a clear sky transitioning from a soft blue to a warm orange near the horizon. In the foreground, there are large, rugged rocks, while the background features distant mountain ranges with subtle shadows and highlights. The scene evokes a sense of tranquility and natural beauty.",
    "task_obj_add_473972.png": " the bustling main concourse of Grand Central Terminal in New York City. The iconic architectural features include a high, turquoise ceiling with constellations, large arched windows allowing natural light, and the famous four-faced clock atop the information booth. The floor is made of polished stone, reflecting the busy scene. Numerous people are moving, creating a dynamic blur of activity, which captures the vibrant life within the station. ",
    "task_obj_add_680532.png": "A natural landscape featuring a primitive wooden footbridge crossing over a small dip in the terrain. The path leading to the bridge is dirt, and the surrounding area is lush with green grass and low vegetation. In the background, there are rocky formations with scattered trees, giving the scene a rugged, outdoorsy feel. Houses can be seen at the edge of the image, implying proximity to a residential area. The area suggests a blend of natural beauty and rustic infrastructure.",
    "task_obj_add_685213.png": "An urban scene with a large, rusty metal panel standing upright in the center. It is situated on a ground with red and black geometric patterns. The surrounding walls are covered in graffiti and street art, including images of faces and abstract designs. There's a window with metal bars and decaying plaster, while fallen leaves are scattered on the ground. Bare tree branches extend into the scene, indicating a possible autumn setting.",
    "task_obj_add_697862.png": "A wartime exhibit related to United States Savings Bonds. At the top left is a framed piece labeled \"DEFENSE SAVINGS BONDS\" with intricate patterns. Below that, a chart titled \"TRAP THE JAP!\" shows a graph with labeled x and y axes, marked with numbers ranging from $1.20 to $1.70. On the right, a leaflet states \"FOR DEFENSE BUY United States Savings Bonds\" and elaborates on the benefits of these bonds. Below this leaflet, a pin with the inscription \"I'M BUYING BONDS\" is fixed to a fabric. In the bottom right corner, there is a display plaque identifying a \"Women's War League pin\", attributed as a gift from Susan M. Fraser. The image is in black and white, and elements are organized in a tidy display case.",
    "task_obj_add_78482.png": "A group of people participating in a protest. They are holding signs with various messages, such as \"FREEDOM FOR ALGERIA 2019,\" \"GETOUT MEANS GETOUT,\" and \"MAKE ALGERIA GREAT AGAIN.\" Some people are draped in Algerian flags. The protest appears to be taking place in an urban area with a stone building and statue in the background. The atmosphere suggests a call for political change or support for Algeria.",
    "task_obj_add_799903.png": "A city skyline during sunset. The silhouette of tall buildings is outlined against a clear sky, with the sun setting behind them, creating a warm orange and yellow glow. The tallest building has distinct antenna-like structures. A few birds can be seen flying across the scene, adding dynamism to the tranquil sunset.",
    "task_obj_add_842279.png": "A snowy landscape with a large red barn-like structure on a hill. There are utility poles and wires running across the scene. Snow covers the ground and tracks are visible leading towards the barn. Trees without leaves can be seen scattered on the hill, and a street lamp is visible in the foreground on the left. The sky is clear, indicating a sunny winter day.",
    "task_obj_add_843073.png": "A woman with long, wavy blond hair styled in a high ponytail. She is wearing a sequin-embroidered checker dress with alternating yellow and white blocks. Her gaze is directed to the side, and she has an intense expression. She is adorned with a choker necklace and is touching her chin with her hand, wearing a large ring on her finger. The background is plain white. The fashion details mentioned include items from the Louis Vuitton Escale à Paris collection.",
    "task_obj_remove_119732.png": "A solitary figure standing on the edge of a rocky cliff, overlooking a majestic mountainous landscape. The mountains in the background are covered in snow, their rugged peaks partially shrouded by dark, overcast clouds, creating a dramatic and moody atmosphere. Below, a lush, green valley with scattered trees can be seen, contrasting with the snowy mountains and adding depth to the scene. The overall tone is one of solitude and awe at the grandeur of nature.",
    "task_obj_remove_241095.png": "A vibrant, animated scene of a superhero, recognizable by their red and black costume with bright red spider-like insignia on the chest, clinging to the side of a brick building. The superhero's hands and feet are illuminated with a red glow. The backdrop is an urban cityscape at night, with buildings, glowing streetlights, and blurred representations of traffic lights indicating a bustling environment. To the left, a window reveals the interior of an apartment where a television is on, displaying a news channel with an image of another superhero in red and blue attire. The city lights create a lively and dynamic atmosphere.",
    "task_obj_remove_336886.png": "A rustic kitchen with a cozy and elegant design. The space features exposed wooden beams on the ceiling and stone walls, adding to the rustic charm. There's a large white refrigerator integrated into the cabinetry. A central island with a white countertop has four stools with fur-covered seats and serves as a focal point. Above the island, two large black pendant lights hang. The kitchen also has open wooden shelves with neatly arranged dishes and jars, and a window providing natural light. The decor includes a few potted plants for a touch of greenery.",
    "task_obj_remove_345101.png": "A section of a bookshelf filled with rows of books. The shelves are made of wood with an old-fashioned, rustic appearance. The books are predominantly of a classic style, many with uniform white or light-colored spines, giving a vintage vibe. Some of the books have decorative designs or gold embellishments on their spines. In front of the shelves, there's a small stack of books placed horizontally, and a portion of a person's clothing and bag is visible on the right side of the image. The setting gives an impression of a traditional library or study room.",
    "task_obj_remove_413106.png": "The image showcases a luxurious and modern living room with a high ceiling and a sophisticated aesthetic. The room features a large, plush sectional sofa adorned with a mix of cushions and throws, creating a cozy yet elegant seating area. Directly above, an intricate and artistic chandelier provides a focal point and adds a touch of opulence. The coffee table situated in front of the sofa is sleek and topped with decorative items. The room is illuminated by a large window, allowing natural light to pour in, highlighting the rich textures and neutral color palette of creams, browns, and blacks. A plant and sculptural floor lamp add to the contemporary décor. The space exudes a sense of luxury and refinement, ideal for both relaxation and stylish entertaining.",
    "task_obj_remove_483875.png": "This is a black and white photograph of a person with short, curly hair and tattoos on their forearms. They are wearing a plain dark t-shirt and sitting at a table with their arms resting on it. The person is looking directly at the camera with a neutral expression. The background is plain, emphasizing the subject.",
    "task_obj_remove_498051.png": "A person inside a cluttered, dimly-lit room with a futuristic or makeshift vibe. They are wearing a virtual reality headset and a glove on one hand, reaching out as if interacting with a virtual environment. The room is filled with various items, including a backpack, a metal container, and walls plastered with newspaper clippings. Soft, diffused light and a smoky atmosphere create a mood of immersion and technology.",
    "task_obj_remove_509477.png": "A group of people gathered closely and smiling at the camera. There are five individuals, with three women and two men. One of the men is holding the camera for a selfie. They are indoors, sitting together with plants and framed pictures on the wall in the background. The atmosphere appears friendly and lively.",
    "task_obj_remove_923634.png": "A moth resting on a rough, stone-like surface. The moth has a patterned appearance with a mix of brown, black, and white colors, providing camouflage against the background. Its wings are folded back, and its antennae are visible. The background is slightly blurred, highlighting the moth as the main subject.",
    "task_obj_swap_joint_mask_159199.png": " two pieces of breaded and baked fish fillets placed on a piece of white parchment paper. The fish is golden brown and appears crispy, garnished with small pieces of chopped herbs. In the background, there is a yellow bell pepper and a red tomato sitting on a wooden surface.",
    "task_obj_swap_joint_mask_218605.png": "A modern, elegant living room with large French doors letting in ample natural light. The room features plush silver-grey chairs with matching cushions. A sleek black chair with a circular back is positioned near a dark accent wall. The focal point of the wall is an artistic, starburst-style piece above a modern built-in fireplace with visible flames. A glass coffee table sits centrally, holding books, a tray, and cylindrical candles. Above, a textured pendant light adds warmth to the sophisticated, neutral-toned decor.",
    "task_obj_swap_joint_mask_310537.png": "A vast desert landscape featuring rugged rock formations and mesas. The foreground has a mix of red and brown hues, possibly indicating eroded rock or desert vegetation. In the background, there are flat-topped mesas and a range of hills silhouetted against a vibrant, multi-colored sky. The sky transitions from a soft blue at the top to a golden yellow near the horizon, suggesting either sunrise or sunset, creating a dramatic and picturesque scene.",
    "task_obj_swap_joint_mask_326030.png": "A red sports car partially visible on the right side, parked on a cobblestone surface. In the background, there is a scenic view of mountainous terrain bathed in warm sunlight, creating a tranquil and picturesque atmosphere. The lighting and angle suggest a sunrise or sunset setting, adding a golden hue to the scene.",
    "task_obj_swap_joint_mask_373242.png": "A stunning landscape of Crater Lake at sunset. The deep blue water of the lake is surrounded by rocky cliffs and is home to a small, tree-covered island. The sky is filled with vibrant orange and purple hues, creating a dramatic backdrop for the scene. Vegetation and rugged rocks are in the foreground, adding depth to the view.",
    "task_obj_swap_joint_mask_549396.png": "A person partially visible, wearing a blue hat and a red patterned coat, holding a large green leaf. Pink flower petals are floating in the air. Behind, there is a white building with a classic design, including a window with flowers on the sill. A garden with various plants and flowers is in the foreground, bordered by a black wrought-iron fence. The atmosphere is whimsical and charming.",
    "task_obj_swap_joint_mask_691092.png": "An interior view of a workshop or studio. A metal ladder is leaning against a white wall. On the wall, several architectural posters and plans are displayed, showcasing different building designs and photographs. To the right of the ladder is a colorful fabric-covered panel in vibrant reds, greens, and yellows, partially covered by black plastic. The upper portion of the wall and ceiling are seen to have industrial fittings, suggesting a utilitarian space intended for creative or construction purposes.",
    "task_obj_swap_joint_mask_709764.png": "A grand, historic building with a detailed stone façade and many windows. In the foreground, there's a pathway lined with neatly trimmed trees, leading towards the building. To the right, there is an ornate stone sculpture featuring a cherub. The scene is surrounded by lush greenery, with trees on the left and well-maintained grass on both sides of the path. The sky is partly cloudy, contributing to a serene atmosphere.",
    "task_obj_swap_joint_mask_830688.png": "A set of printed flyers on a textured surface. The flyers advertise services related to abortions, promoting a contact named Linda with a phone number for further inquiries. The text mentions \"100% Guarantee,\" \"Safe and Pain-Free,\" and \"Free Body and Blood Detoxification.\" The flyers use a mix of blue and red text, with some text oriented vertically. The texture beneath the flyers suggests a stone or marble surface with a beige and brown pattern.",
    "task_obj_swap_joint_mask_86534.png": "A person in a lab setting, wearing a white coat, gloves, and a hairnet. They are looking at or inspecting a book with a decorative cover. In the foreground, there are rows of white bottles with pump dispensers. In the background, a stainless steel machine and other laboratory equipment can be seen. The environment appears clean and sterile.",
    "task_obj_swap_joint_mask_873067.png": "A rustic indoor display of vintage military items. A pilot’s parachute canopy is encased in a clear bag and placed on an upper shelf. Below it, a tag with a photograph and description provides information about the parachute. Several pairs of military boots, both tan and black, are arranged on lower shelves. To the right, a neon \"OPEN\" sign is lit in bright green and purple. Various other military items and accessories, including bags and hats, feature in the background, creating a nostalgic military surplus store atmosphere.",
    "task_obj_swap_rand_mask_103979.png": "A person dressed in formal attire, wearing a black tuxedo with a white shirt and black bow tie. They are holding a tray with a glass and other items, possibly in a professional serving capacity. The background features part of a room with a doorway and light coming through.",
    "task_obj_swap_rand_mask_17969.png": "An advertisement for the \"2021 Summer Collection\" featuring a business style from the brand \"Grand-Back Big & Tall.\" The background is a deep blue with geometric patterns. The left side displays the text in a prominent, elegant font, while the right side shows cropped images of folded suits and shirts in blue and grey, indicating a focus on formal attire. The overall design is sleek and professional, highlighting business fashion for larger and taller individuals.",
    "task_obj_swap_rand_mask_204166.png": "A vast, dramatic sky dominated by large, billowing clouds. The clouds are illuminated with warm golden and light gray tones, suggesting the light of either sunrise or sunset. Below the cloud formation, there's a thin strip of green, indicating a distant grassy landscape. In the foreground, a textured, sandy surface stretches across the image, creating a contrast with the sky and clouds above. The sky is a deep, clear blue, enhancing the striking appearance of the clouds.",
    "task_obj_swap_rand_mask_216136.png": "A dramatic night sky with circular star trails, suggesting a long exposure photograph capturing the rotation of the Earth. The foreground features a desert landscape with rocky hills and scattered shrubs. There are also unique, modern, golden sculptures with fork-like shapes set on a circular pattern on the ground. The logo of CNN iReport is visible in the top-left corner.",
    "task_obj_swap_rand_mask_228626.png": " three people standing in front of a row of illuminated round lights. The person on the left is wearing sunglasses, a beanie, and a dark outfit with a necklace. The person in the center has shoulder-length blond hair, is playfully biting a scarf or shirt sleeve, and is wearing a black shirt with a graphic design. The person on the right has tattooed arms, wearing a sequined or shimmering top, and several rings. The overall vibe is edgy and stylish.",
    "task_obj_swap_rand_mask_281435.png": "A person dressed as a vampire. They have pale skin, dark eyes with red accents, and are showing prominent fangs. The costume features a black cape with a red lining and a high collar. The background is a muted yellow with a faint, ghostly pattern that resembles wispy branches or smoke.",
    "task_obj_swap_rand_mask_396745.png": "A warrior in traditional samurai armor standing in front of a fire, holding a long weapon, possibly a cannon or gun, on his shoulder. The background is dramatic, with dark smoke billowing from the fire, and there is a sense of intensity and battle-readiness in the scene. The grass in the foreground adds a sense of movement with the flames and smoke creating a fiery backdrop.",
    "task_obj_swap_rand_mask_401099.png": "A group of four people outdoors, enjoying a casual moment together. They appear to be engaging with each other enthusiastically. One person is holding a pizza box, and another is holding a jar. The setting is sunny and green, suggesting a park or natural area. The individuals are smiling and seem to be having a pleasant conversation, indicating a friendly atmosphere.",
    "task_obj_swap_rand_mask_432309.png": "A serene landscape featuring a range of mountains with distinct, jagged peaks. In the foreground, there is a lush green hillside that gently slopes downward, creating a contrast with the rugged mountains. The sky above is clear and bright blue, adding to the tranquil atmosphere of the scene.",
    "task_obj_swap_rand_mask_439346.png": "A man wearing futuristic armor-like attire. The armor is sleek with segmented panels and appears to be made of a light-colored metallic material. He has a neutral expression and is looking to the side. The background is dark, emphasizing the subject. There's a yellow section in the lower corner with the text \"from 201\" indicating it might be part of a larger heading or title.",
    "task_obj_swap_rand_mask_457150.png": "A striking landscape that combines elements of desert and mountain scenery. The foreground showcases smooth, golden sand dunes with distinct ripples. In the background, there are towering, snow-capped mountains partly covered with dark forest. The sky above is partly cloudy, with a warm glow from the sunlight. The scene creates a stunning contrast between the arid desert and the snowy peaks.",
    "task_obj_swap_rand_mask_52865.png": "A digital rendering of an urban landscape featuring a multi-lane road with vehicles. On the right side, there's a large, wooden, tiered structure surrounded by greenery and pink flowering trees, possibly sakura. In the lower left, there is a parking area with several cars. The area appears to include pedestrian pathways and landscaped sections, suggesting a blend of urban and natural elements. In the background, there are more trees and buildings, indicating a developed environment.",
    "task_obj_swap_rand_mask_564069.png": "A building with a vertical red sign, featuring large white letters that read \"MOVIS.\" The building is next to a tree with sparse branches and green leaves against a bright blue sky. The scene evokes a clear, sunny day in an urban setting.",
    "task_obj_swap_rand_mask_594596.png": "A serene field scene where several individuals are seated in large blue containers placed amidst the golden and green grass of a grassy field. The focus is on a person wearing a wide-brimmed straw hat, partially obscured as they are nestled within one of the blue containers. In the background, other people are similarly situated in their containers across the field, with trees and a distant mountain range under a bright blue, slightly cloudy sky. The blue containers contrast vividly against the natural, earthy tones of the grass and landscape.",
    "task_obj_swap_rand_mask_658687.png": "A serene scene of a person kayaking on a calm body of water, with the stunning backdrop of a vivid sunset. The sky is painted with a spectacular array of colors, including pink, orange, blue, and purple hues that reflect beautifully on the water. The silhouette of the kayaker is seen a short distance away, paddling towards the setting sun, which is partially obscured by a treeline on the horizon. The foreground features the edge of another kayak, suggesting a companion or photographer’s perspective. The overall atmosphere is tranquil and picturesque, highlighting the beauty of nature.",
    "task_obj_swap_rand_mask_78095.png": "An outdoor setting with a black rocking chair featuring a light yellow cushion. A white pillow is placed on the chair. Nearby, there is a white vase filled with white roses and green foliage. The background includes lush green plants and a metal railing, suggesting a balcony or patio area.",
    "task_obj_swap_rand_mask_92564.png": " four people standing in an office setting with a \"The Boston Globe\" sign in the background. They are dressed in work attire: one in a white shirt and dark pants, another in a checkered shirt and khaki pants, a third in a dark button-up shirt and black pants, and the fourth in a black shirt. The office environment suggests a professional or journalistic setting.",
    "task_style_108111.png": "A post-apocalyptic scene in an urban setting. Several people are gathered around makeshift tents made from tarps and other materials. One person is pushing a wheelbarrow, while another walks nearby carrying supplies. A fire burns in a metal container, and a person is seated beside it, likely warming themselves. The background shows dilapidated buildings and bare, leafless trees, suggesting a cold, desolate environment. The atmosphere is gritty and somber, with muted colors and a sense of survival amid ruins.",
    "task_style_109219.png": "An illustration of three businesspeople lifting a large barbell together. The barbell has a massive weight on the left side, resembling a spool. The individuals are standing side by side, wearing business attire with white shirts and orange ties. The background features a stylized blue design with abstract graphs and charts, suggesting a concept of teamwork and financial growth.",
    "task_style_10945.png": "A serene autumn scene in a park. There is a row of large trees with thick trunks, their bark displaying a mix of colors. The ground is covered with vibrant red and orange fallen leaves, creating a rich carpet across the scene. To the right, there is an empty park bench with ornate metal details, positioned among the leaves, adding to the tranquil and picturesque atmosphere.",
    "task_style_116833.png": "The face of a man with short brown hair and a serious expression, against a dark background. The lighting highlights his facial features, casting subtle shadows on his face. The image has a portrait-like quality, focusing closely on the man's face.",
    "task_style_118637.png": "A waterfall cascading down a rugged rocky cliff. The scene is set in a cold environment, as evidenced by snow and ice covering the rocks around the flowing water. The sky is overcast, creating a moody, atmospheric ambiance. The water appears smooth, suggesting a long exposure photograph.",
    "task_style_121254.png": "A digital rendering of a woman with long black hair styled back elegantly. She is wearing gold earrings with pearl-like pendants and is dressed in a red and white garment with intricate patterns. The background is dark, highlighting her refined and serene expression.",
    "task_style_145941.png": "A portion of a person with long, flowing hair, featuring shades of brown and blonde highlights, against a soft, light background. The lower part of the image reveals what appears to be a coat or garment lined with cream-colored fur or shearling material, visible along the collar or edge. The lighting in the image is warm, casting gentle highlights on both the hair and the fur-lined fabric.",
    "task_style_146432.png": "A black Jeep Wrangler parked on a road. It's a four-door model with shiny metallic paint and round headlights. The car is set against a scenic backdrop of rugged mountains and an orange-tinted sky, suggesting a sunset or sunrise. The vehicle is angled to show its front and driver's side.",
    "task_style_179358.png": "A character in a dynamic pose, seemingly from a video game. The character is wearing a vibrant pink outfit with puffy sleeves adorned with gold accents. Her hair is styled in traditional buns with ribbons, and she has an intense expression. Blue energy or water-like effects swirl around her, suggesting action or special ability use. The background appears to be a night sky with a radar tower visible, and the character's health bar is shown at the top.",
    "task_style_181712.png": "This image depicts a modern living room with a beige leather reclining sofa. The sofa is adorned with two gray throw pillows. Behind it, a concrete wall serves as the backdrop, featuring a floating shelf with decorative items such as framed artwork, a candle, and a small potted plant. To the left of the sofa, there's a wooden side table holding a vase with flowers and a book. The floor is covered with a light-colored rug, adding to the room's contemporary and cozy atmosphere.",
    "task_style_209626.png": "A cityscape featuring a river in the foreground with reflections, bordered by trees and palm trees. In the background, a mix of modern skyscrapers and historic architecture is visible, including a church with tall spires. The sky is mostly clear with some clouds, and the sun appears to be setting or rising, casting a warm light on the buildings.",
    "task_style_222901.png": "A watercolor painting depicting a hilly landscape. In the foreground, there are stylized trees with dark green foliage. The rolling hills are painted in shades of green and yellow, with shadow effects. A large mountain in the background is rendered in purple and pink hues, with a partly cloudy sky above, adding depth and atmosphere to the scene.",
    "task_style_239882.png": "A dramatic, atmospheric landscape featuring a group of four yaks walking along a narrow mountain path. The background includes towering cliffs and mist, giving a sense of height and ruggedness. Lush green foliage is visible amidst the rocky terrain, while colorful prayer flags hang across the path, adding cultural and spiritual elements to the scene. The overall mood is one of tranquility and natural beauty, set in a remote, mountainous region.",
    "task_style_240578.png": "The iconic façade of Notre-Dame Cathedral in Paris highlighted under a partly cloudy sky. The cathedral's prominent twin towers and ornate, Gothic architecture are in clear view. Bare trees frame the scene, indicating a winter setting, and a decorated Christmas tree stands nearby. The Seine River is visible in the foreground, with a stone wall lining its edge. Surrounding buildings can be seen, contributing to the classic Parisian atmosphere.",
    "task_style_244288.png": "The image showcases a stunning landscape view of Torres del Paine National Park in Patagonia, Chile, during sunset. The majestic peaks of the Paine Massif, partially covered in snow, are prominently featured in the background. The sky above is painted with vibrant hues of pink, orange, and purple, reflecting beautifully on the calm waters of a small, serene lake in the foreground. The foreground is filled with dense shrubbery and low-lying vegetation, adding depth and texture to the scene. The overall atmosphere is tranquil and captivating, highlighting the natural beauty of this remote region.",
    "task_style_25550.png": "A serene scene featuring a historic church nestled in an idyllic landscape during autumn. The church, characterized by its charming onion dome and white facade with pink accents, is situated on a gentle, grassy hill. In the foreground, a winding road curves gracefully alongside vibrant autumn foliage, showcasing hues of orange, red, and gold. Towering mountains in the background, partly shrouded by moody, cloud-laden skies, add a majestic backdrop to this picturesque setting. The image exudes a peaceful and timeless atmosphere typical of a European countryside in fall.",
    "task_style_288013.png": " Westminster Bridge in London, capturing a side view with the iconic Elizabeth Tower, often referred to as Big Ben, in the background. People are walking across the bridge, and the sky is partly cloudy with a mix of blue and soft orange hues, suggesting an early morning or late afternoon setting. The architectural details of the gothic-style buildings are visible, creating a picturesque urban scene.",
    "task_style_294398.png": "A brick house with a large conservatory attached. The conservatory has a white frame with clear glass windows and roofing. Inside, wooden flooring and beige cushioned chairs around a table are visible. Outside, terracotta and white pots with plants and a decorative stone figure of an animal are on the paved surface.",
    "task_style_44408.png": "A small green plastic container resembling a trash can. It has a lid with a handle on top and vertical indents on its sides. The container is placed on a blurred outdoor surface, possibly concrete or pavement. The background is out of focus, creating a bokeh effect.",
    "task_style_56417.png": "An old, weathered wooden building positioned on a hillside. It has multiple small windows and a sloped roof with a series of additional windows at its peak. The setting is rustic, surrounded by trees and a distant view of rolling hills under a cloudy sky. The atmosphere conveys a sense of isolation and tranquility, with the landscape stretching into the horizon.",
    "task_obj_remove_557920.png": "A close-up of a wooden signboard partially displaying the words \"FREUD M\" on its right side, against the backdrop of a red brick building, identified as the Freud Museum. The building has white-framed windows and two blue plaques, suggesting historical significance. The foreground contains bushes and greenery, while the perspective is slightly tilted, creating a dynamic composition. The overall tone of the photograph is warm, with a mild sepia-like filter, giving it a vintage look.",
    "task_obj_remove_595730.png": "A well-organized cafe counter. On the counter are various items including a coffee machine, metal pitchers, and packets of milk. There's a dish with chips, and a cake or pie on a plate. Above the counter, two shelves display liquor bottles, packages of pastries, and decorative tins. The background features a mosaic-style tile pattern. Under the counter, glassware is stored alongside bottles of soft drinks.",
    "task_obj_remove_619997.png": "A street scene with several people walking along a sidewalk. There are storefronts including a Wells Fargo bank and a clothing store named \"Loyal Army Clothing.\" The architecture features a modern design with glass and decorative panels. A small red vehicle is parked nearby, and there are trees partially visible on the left side.",
    "task_obj_remove_807511.png": "A surfer is riding a wave on a yellow board, wearing a black wetsuit, balancing skillfully. The ocean appears rough with multiple waves, and other surfers are visible in the background, either paddling or lying on their boards. The sky is overcast, adding a grey tone to the scene."
}